#1. [Survived] EqualityOperator
src/refunds.js:13:10
-     return daysSinceDelivery < REFUND_WINDOW_DAYS;
+     return daysSinceDelivery <= REFUND_WINDOW_DAYS;
Tests ran:
    a recent delivery is refundable
    an old delivery is not refundable

#2. [Survived] EqualityOperator
src/refunds.js:17:10
-     return orderTotalEur >= FREE_RETURN_MIN_EUR;
+     return orderTotalEur > FREE_RETURN_MIN_EUR;
Tests ran:
    small orders pay their own return shipping
    large orders get return shipping refunded

#3. [Survived] EqualityOperator
src/refunds.js:21:7
-     if (daysSinceDelivery > RESTOCK_AFTER_DAYS) {
+     if (daysSinceDelivery >= RESTOCK_AFTER_DAYS) {
Tests ran:
    no restocking fee in the first days
    restocking fee charged on a late return
